html/nginx-site-redirect.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>nginx站点跳转</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">nginx站点跳转</h1>
<p>
从dirlt.com跳转到dirtysalt.info
</p>
<pre class="example">
http {
    server_name dirlt.com;
    rewrite ^ $scheme://dirtysalt.info$request_uri? permanent;
}
</pre>

<p>
这样访问dirlt.com时候，返回HTTP Permanent Redirect
</p>

<pre class="example">
➜~  curl -v -S dirlt.com
-* Rebuilt URL to: dirlt.com/
-*   Trying 139.162.32.139...
-* Connected to dirlt.com (127.0.0.1) port 80 (#0)
&gt; GET / HTTP/1.1
&gt; Host: dirlt.com
&gt; User-Agent: curl/7.43.0
&gt; Accept: */*
&gt;
&lt; HTTP/1.1 301 Moved Permanently
&lt; Server: nginx/1.4.6 (Ubuntu)
&lt; Date: Sat, 26 Mar 2016 02:25:22 GMT
&lt; Content-Type: text/html
&lt; Content-Length: 193
&lt; Connection: keep-alive
&lt; Location: http://dirtysalt.info/
&lt;
&lt;html&gt;
&lt;head&gt;&lt;title&gt;301 Moved Permanently&lt;/title&gt;&lt;/head&gt;
&lt;body bgcolor="white"&gt;
&lt;center&gt;&lt;h1&gt;301 Moved Permanently&lt;/h1&gt;&lt;/center&gt;
&lt;hr&gt;&lt;center&gt;nginx/1.4.6 (Ubuntu)&lt;/center&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre>
</div>
</body>
</html>
